s-wei-11/stm32-freertos-can-bus/Node_Master_Gateway_407/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define fmq_Pin GPIO_PIN_13
#define fmq_GPIO_Port GPIOC
#define led_Pin GPIO_PIN_8
#define led_GPIO_Port GPIOE
#define ledE10_Pin GPIO_PIN_10
#define ledE10_GPIO_Port GPIOE
#define ledE12_Pin GPIO_PIN_12
#define ledE12_GPIO_Port GPIOE
#define LCD_CS_Pin GPIO_PIN_12
#define LCD_CS_GPIO_Port GPIOB
#define LCD_BLK_Pin GPIO_PIN_8
#define LCD_BLK_GPIO_Port GPIOD
#define LCD_DC_Pin GPIO_PIN_9
#define LCD_DC_GPIO_Port GPIOD
#define LCD_RES_Pin GPIO_PIN_10
#define LCD_RES_GPIO_Port GPIOD
#define SD_Pin GPIO_PIN_3
#define SD_GPIO_Port GPIOD
#define BUTTON_Pin GPIO_PIN_4
#define BUTTON_GPIO_Port GPIOD
#define BUTTOND5_Pin GPIO_PIN_5
#define BUTTOND5_GPIO_Port GPIOD
#define BUTTOND6_Pin GPIO_PIN_6
#define BUTTOND6_GPIO_Port GPIOD
#define BUTTOND7_Pin GPIO_PIN_7
#define BUTTOND7_GPIO_Port GPIOD

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
